import styles from "./style.module.scss";
import { ReactElement } from "react";
import Head from "next/head";
import Layout from "@/main/components/Layout";
import ExpandMoreIcon from "@/shared/assets/icons/expandMore.svg";
import TargetImage from "@/main/assets/images/target.svg";
import HappyPeopleImage from "@/main/assets/images/happyPeople.svg";
import PrintImage from "@/main/assets/images/print.svg";
import OnlineOrderImage from "@/main/assets/images/onlineOrder.svg";
import PostageImage from "@/main/assets/images/postage.svg";
import QualityImage from "@/main/assets/images/quality.svg";
import SupportImage from "@/main/assets/images/support.svg";
import BookImage from "@/main/assets/images/book.svg";
import OurCustomers from "@/main/components/OurCustomers";
import { FormattedNumber } from "react-intl";

export default function AboutUs() {
  return (
    <div className={styles.Container}>
      <Head>
        <title>صفحه اصلی</title>
      </Head>
      <div className={styles.Introduction}>
        <div></div>
        <div>
          <h2>درباره چاپ روم</h2>
          <p>
            چاپ روم یک سرویس پرینت و کپی آنلاین است که از سال 1398 فعالیت خود را
            در جهت بهینه سازی هزینه های چاپ و پرینت تا 90 درصد آغاز نمود. شما
            قادر خواهید بود از طریق وب سایت چاپ روم یا شبکه های اجتماعی سفارش
            خود را ثبت کنید سپس جزوه یا فایل خود را در قسمت مربوطه آپلود نمایید
            و با بالاترین کیفیت و سرعت جزوه خود را پرینت و درب منزل دریافت کنید.
          </p>
          <p>
            استارت آپ چاپ روم با استفاده از بهترین تکنولوژی چاپ قابلیت ارائه صد
            هزار صفحه در روز را برای مشتریان خود دارد. تمامی فرایند چاپ و پرینت
            از ابتدا تا انتها توسط پرسنل با تجربه و فنی انجام می شود و خیال شما
            باید از بابت کیفیت و امنیت کار راحت باشد.
          </p>
        </div>
      </div>
      <div className={styles.ReadMore}>
        بیشتر بخوانید
        <ExpandMoreIcon />
      </div>
      <div className={styles.Section1}>
        <div>
          <div>
            <h2>هدف تاسیس چاپ روم</h2>
            <p>
              داستان از جایی شروع شد که خودمان دانشجو بودیم و جزوه و کتاب های
              خودمون رو میخواستیم پرینت کنیم، ولی هر وقت خواستیم بریم دفاتر فنی
              برای چاپ، به خاطر هزینه های زیاد چاپ مجبور بودیم یا کلا از پرینت
              جزوات خودمون منصرف بشیم و یا چند تا از جزوات خودمون رو چاپ کنیم،
              بالاخره ما هم دانشجو بودیم و مشکل مالی همیشه داشتیم. بعدها دیدیم
              که خود دانشگاهمون یه دفتر فنی را داخل خود دانشگاه به مزایده گذاشت.
              من و چند تا از دوستام تصمیم گرفتیم که در این مزایده شرکت کنیم و
              هدف خودمون این بود که واقعا ببینیم هزینه تمام شده یک برگه برای
              خودمون چقدره؟ پول‌های خودمون رو روی هم گذاشتیم، و دو تا دستگاه
              معمولی پرینتر خریدیم. بعد از چند وقت به هدف اصلی خودمون رسیدیم و
              به چشم خودمون دیدیم که هزینه پزینت خیلی خیلی کمتر از هزینه های
              بیرون هستند.
            </p>
          </div>
        </div>
        <div>
          <TargetImage />
        </div>
      </div>
      <div className={styles.Section2}>
        <div>
          <HappyPeopleImage />
        </div>
        <div>
          <div>
            <h2>چه مشکلاتی رو تونستیم برطرف کنیم؟</h2>
            <p>
              بعد از چند وقت تصمیم گرفتیم که کار خودمون رو گسترش بدیم. اولین
              ایده این بود که بتونیم برای کلیه دانشجویان و دانش آموزان، یک
              سیستمی راه اندازی بکنیم که بتونند از سراسر کشور پرینت خودشون رو با
              قیمت پایین به ما بسپارند. از همین رو تصمیم به طراحی سایت چاپ روم
              گرفتیم و این امکان را برای کلیه آنها فراهم کردیم. یکی دیگه از
              مشکلاتی که جامعه هدف ما دارند اینه که زمانی که ازشون گرفته میشه که
              یک جزوه را پرینت کنند خیلی زیاده. ولی از طریق سایت چاپ روم به
              راحتی میتونند در خانه یا خوابگاه، سفارش خودشون رو ثبت کنند و جزوه
              چاپ شده را با بهترین کیفیت ممکن، درب منزل در سریع ترین زمان ممکن
              دریافت کنند.بعد ها فهمیدیم که دانشجویان مقاطع تکمیلی و نویسندگان
              هم بابت چاپ کتابشون خیلی مشکل دارند. منظورمون هم هزینه چاپ هستش و
              هم مجوزهای نشر. قبول داریم که این موضوع خیلی اذیتتون میکنه. به
              همین دلیل تصمیم گرفتیم که بخش چاپ و نشر کتاب رو هم راه اندازی کنیم
              و تمام تلاشمون این بود که بتونیم که مشکلات این دسته از افراد رو هم
              برطرف کنیم.
            </p>
          </div>
        </div>
      </div>
      <div className={styles.Services}>
        <div>
          <h2>خدمات چاپ روم</h2>
          <div>
            <h3>پرینت جزوه و کتاب</h3>
            <p>
              چاپ روم با استفاده از بهترین پرینترها و کاغذهای اورجینال، جزوه و
              کتاب شما را با ارزان ترین قیمت چاپ و تکثیر می‌کند.
            </p>
          </div>
          <div>
            <h3>سفارش آنلاین</h3>
            <p>
              چاپ و پرینت مطبوعات، کتب و مجلات و فایل های مربوط به مدارس و
              آموزشگاه ها چاپ اسناد و مجلات و فایل های مربوط به سازمان ها و
              ارگان ها
            </p>
          </div>
          <div>
            <h3>ارسال به سراسر کشور</h3>
            <p>
              امکان ارسال سفارشات به کل کشور وجود دارد و همچنین سفارشات بالای{" "}
              <FormattedNumber value={2000} /> برگ به صورت رایگان ارسال می شود.
            </p>
          </div>
          <div>
            <h3>تضمین کیفیت</h3>
            <p>
              چاپ روم کیفیت چاپ را تضمین می کنید و در صورت هرگونه مشکل چاپی
              هزینه چاپ را عودت می دهید.
            </p>
          </div>
          <div>
            <h3>
              پشتیبانی <FormattedNumber value={24} /> ساعته
            </h3>
            <p>
              در صورت داشتن هرگونه سوال پشتیبانان چاپ روم آماده ارائه خدمات
              پشتیبانی به شما هستند.
            </p>
          </div>
          <div>
            <h3>خدمات نشر و چاپ کتاب</h3>
            <p>
              کلیه خدمات نشر و چاپ کتاب اعم از ویراستاری، صفحه بندی و دریافت
              مجوزهای لازم ویژه انتشارات و موسسات آموزشی
            </p>
          </div>
        </div>
      </div>
      <div className={styles.Customers}>
        <h2>مشتریان ما</h2>
        <p>
          به لطف خداوند توانسته ایم در این چند سال به خاطر کیفیت کارمون و هزینه
          پایین چاپ، مشتریانی از سراسر کشور داشته باشیم. در حال حاضر ده ها مدرسه
          از سراسر کشور سفارشات خودشون رو به ما سپرده اند. و چندین آموزشگاه زبان
          مطرح از سراسر کشور در حال تعامل هستیم. همچنین توانسته ایم با چندین
          انتشارات از استان های تهران، کرج، قم و اصفهان همکاری داشته باشیم. در
          ضمن توانسته ایم با شرکت ها و کارخانجات تولیدی داخل کشور همکاری داشته
          باشیم و همواره اعتقاد داریم بزرگترین افتخار ما، رضایت مشتری است.
        </p>
      </div>
      <div className={styles.OurCustomersContainer}>
        <OurCustomers />
      </div>
    </div>
  );
}

AboutUs.getLayout = function getLayout(page: ReactElement) {
  return <Layout>{page}</Layout>;
};
